/**
 * Отработка арифметических операторов
 * Создайте переменную и задайте ей любое числовое значение
 * ИСПОЛЬЗУЕМ АРИФМЕТКУ, НЕ СЧИТАЕМ РУКАМИ!!!
 * Увеличьте значение в 2 раза
 * Вычтите 10
 * Возьмите остаток от деления на 8
 * Возведите в третью степень
 * Увеличьте на 1 инкрементом
 * Выведите результат
 */

let ami = 50;
ami = 50;
console.log(ami);
 ami *= 2;
console.log(ami);
 ami -=10;
console.log(ami);
 ami /=8;
console.log(ami);
 ami **=3;
console.log(ami++);
 ami ++;
console.log(ami++);