# V Пользователь вводит с клавиатуры два числа
# (начало и конец диапазона). Требуется проанализировать 
# все числа в этом диапазоне по следующему правилу: если 
# число кратно 7, его надо выводить на экран.

komu_kratno = 7

# БЕЗ range

num1 = input('Введи первое число: ')
# Ввод от пользователя состоит из трёх важных компонент:
# 1. Переменная, в которую будет сохранен результат ввода
# 2. Функция input, которая, собственно, ждёт ввода с клавиатуры до нажатия клавиши ввод и возвращает строку
# 3. Внутри функции input должен быть строковый параметр, который пригласит пользователя вводить что-либо (например: 'Введи своё имя')
num1 = int(num1)  # Преобразуем строку в число
num2 = input('Введи второе число: ')
num2 = int(num2)  # Преобразуем строку в число
# int - integer, целое число, тип данных такой

# Как узнать тип данных вашей переменной или выражения?
print(type(num2))

# Цикл состоит из ключевого слова while, условия ПРОДОЛЖЕНИЯ
# и тела после двоеточия, переноса строки и отступа

# "Не равно" - это значок, состоящий из воскл и равн: !=
# "Не больше" - <= - "меньше или равно"
# "Не меньше" - >= - "больше или равно"
# "Арифметическое присваивание" - вычислить и туда же запомнить -=, +=, *=, /=...

num1 -= num1 % komu_kratno - komu_kratno  # Вычесть остаток от деления на 7
# komu_kratno = 7
while num1 <= num2:
    print(num1)
    num1 = num1 + komu_kratno