#Задание 3:
#Написать программу, в которой есть переменная, равная 25
#Вывести на экран все числа от 1 до 25
#Обязательно использовать цикл while

konets = 25
nachalo = 1

while nachalo <= konets:
  print(nachalo)
  nachalo += 1



