/**
 * 1. С помощью арифметических присваиваний просто арифметических операторов
 * и инкремента и декремента (--) выполнить следующие преобразования:
 * Создать переменную номер секунды (больше 30). Прибавить к ней 580 секунд.
 * Не применяя ветвления (if), а только с помощью арифметики, сказать,
 * сколько получилось минут и секунд?
 * 2. Поставить вопросы компьютеру:
 * 2.1 Правда ли, что 5800 секунд больше часа? Больше 2х часов?
 * 2.2 Правда ли, что если цена составляет 230 рублей за штуку
 *  и купили 27 штук, то хватит 500 рублей? 5000 рублей? 7000 рублей?
 * 2.3 Правда ли, что 5000 рублей хватит, а 7000 НЕ хватит 
 * (использовать отрицание, конъюнкцию и дизъюнкцию на свое усмотрение)
 * НЕПРАВИЛЬНАЯ ДОМАШКА:
 * console.log(6210 < 5000, 'ПРАВДА!')
 */

let min1 = 59 + sec ;
min1 = 59 + sec ;
let sec = 1 ;
sec = 1 ; 
let h1 = 59 + min1 ;
h1 = 59 + min1 ;
console.log(min1);
