console.log('Скрипт подключен')
/**
 * 1. Создать ряд
 * 2. Прикрепить ряд к таблице
 * 3. Создать ячейку
 * 4. Прикрепить ячейку к РЯДУ
 * 5. В ячейке написать 2*2=4
 * 6. Сделать ряд ячеек с числами от 1 до 9
 */
const max_num = 9  // до какого числа лепим табличку?
// Как поставить атрибут к элементу?
header.setAttribute('colspan', max_num)
// Создать номер ряда
let row = 1
while (row <= max_num) {
    // 1. Создать ряд
    let tr = document.createElement('tr')  // Внутри название элемента, который мы создаем
    // 2. Прикрепить ряд к таблице
    // КУДА присоединяем ЧТО
    multbl.appendChild(   tr)
    // к таблице по айдишнику присоединяем свежесозданный ряд
    let column = 1  // номер ячейки, он же - циферка в ней
    while (column <= max_num) {
        // ПОВТОРЯТЬ, ПОКА НЕ ДОСТИГНЕМ 9
        // 3. Создать ячейку
        let td = document.createElement('td')
        // 4. Прикрепить ячейку к РЯДУ
        tr.appendChild(td)
        // 5. В ячейке написать 1
        td.textContent = column * row  // В ячейке хранится номер ряда, умноженный на номер ячейки в ряду
        column++  // увеличили номер ячейки и число в ней на 1
    }
    row++  // Если забудем увеличивать счётчик, цикл будет бесконечным, т.к. на его условие ничто не повлияет
}